{
  "title": "Software Engineering",
  "description": "",
  "levels": [
    {
      "scope": [
        "Software engineer at the beginning of their career.",
        "May require some theoretical or specialised functional knowledge.",
        "Might have no prior functional experience but can demonstrate passion and learning capabilities.",
        "Works as part of a dedicated project squad."
      ],
      "focusAreas": [
        "Develops understanding of agile methodologies and focuses on improving technology skills associated with the day-to-day squad work.",
        "Learns to write high quality code following appropriate guidance and training materials",
        "Implements well-defined/well understood stories or bug fixes",
        "Able to use source control and related workflows effectively",
        "Able to use appropriate debugging tools effectively to increase productivity and investigation skills",
        "Ensure code meets business requirements",
        "Uses suitable testing techniques",
        "Establishes first Personal Development Plan (PDP)",
        "Delivers assigned tasks",
        "Independently works on small/low-impact/well-defined tasks",
        "Follows delegated tasks well",
        "Embraces Agile/Lean principles to deliver value often",
        "Fixes documentation",
        "Asks questions and actions feedback when pairing",
        "Writes PR descriptions that provide basic context for the change",
        "Seeks guidance from others, rather than answers",
        "Embraces peer feedback"
      ],
      "model": {
        "seventy": ["seventy One", "seventy Two", "seventy Three"],
        "twenty": ["twenty One", "twenty Two", "twenty Three"],
        "ten": ["ten One", "ten Two", "ten Three"]
      }
    },
    {
      "scope": [
        "Established contributor, can analyse and solve routine queries and challenges with little oversight",
        "Applies own judgement and experience when dealing with problems without clear precedent.",
        "Has good understanding of existing procedures and processes and is able to escalate problems as appropriate within the team.",
        "Builds relationships with engineers from related squads."
      ],
      "focusAreas": [
        "Actively understands our SDLC and contributes to all aspects of it. Appropriately uses software and architectural design, driving towards industry standard patterns. ",
        "Is conscious of technical debt and the impact of not effectively managing it. ",
        "Starts focusing on NFRs of their work.",
        "Uses appropriate data structures to solve problems",
        "Writes comprehensive automated and unit tests",
        "Assists on the design of new features and componentsIntegrates services together",
        "Considers error handling appropriately",
        "Proactively stays up-to-date with the latest engineering trendsImplements a varying complexity of stories/bug fixes",
        "Participate in code reviews",
        "Considers the maintainability of their code",
        "Delivers assigned tasks that meet acceptance criteria",
        "Attempts to unblock themselves before seeking help",
        "Delivers small, well defined projects",
        "Be adept at root cause analysisContributes to technical documentation",
        "Contributes to tooling/application quality/coding standards",
        "Demonstrates a deep technical understanding of the services they own",
        "Writes PR descriptions that provide context and provide rationale for significant decisions",
        "Participates in technical discussions with the team"
      ],
      "model": {
        "seventy": [
          "Designs, codes, verifies, tests, documents, amends and refactors simple programs/scripts. Applies agreed standards and tools, to achieve a well-engineered result. Reviews own work.",
          "Creates and documents detailed designs for simple software applications or components applying agreed modelling techniques, standards, patterns and tools. Contributes to the design of components of larger software systems. Reviews own work.",
          "Defines test conditions for given requirements. Designs test cases and creates test scripts and supporting data, working to the specifications provided. Interprets, executes and records test cases in accordance with project test plans. Analyses and reports test activities and results. Identifies and reports issues and risks."
        ],
        "twenty": ["twenty One", "twenty Two", "twenty Three"],
        "ten": ["ten One", "ten Two", "ten Three"]
      }
    }
  ]
}
